@rocktavious added your suggestions by re-adding `owner_alias` in the resource and datasource. Also added validation that allows the user to pass one or the other but not both. Here's the tophatting output (the `alias slug` bug is still happening, not relevant to this PR.):

```
$ cat service.tf
resource "opslevel_team" "new_team" {
    name = "this team was made in terraform"
}

resource "opslevel_service" "new_service_old" {
  name = "new service with owner_alias"

  description = "this was made in terraform"
  framework   = "rails"
  language    = "ruby"

  owner_alias = opslevel_team.new_team.alias
}

resource "opslevel_service" "new_service_alias" {
  name = "new service with owner (alias)"

  description = "this was made in terraform"
  framework   = "rails"
  language    = "ruby"

  owner = opslevel_team.new_team.alias
}

resource "opslevel_service" "new_service_id" {
  name = "new service with owner (id)"

  description = "this was made in terraform"
  framework   = "rails"
  language    = "ruby"

  owner = opslevel_team.new_team.id
}

resource "opslevel_service" "new_service_both" {
  name = "new service with owner (both, should fail)"

  description = "this was made in terraform"
  framework   = "rails"
  language    = "ruby"

  owner = opslevel_team.new_team.alias
  owner_alias = opslevel_team.new_team.alias
}
$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # opslevel_service.new_service_alias will be created
  + resource "opslevel_service" "new_service_alias" {
      + description  = "this was made in terraform"
      + framework    = "rails"
      + id           = (known after apply)
      + language     = "ruby"
      + last_updated = (known after apply)
      + name         = "new service with owner (alias)"
      + owner        = (known after apply)
    }

  # opslevel_service.new_service_both will be created
  + resource "opslevel_service" "new_service_both" {
      + description  = "this was made in terraform"
      + framework    = "rails"
      + id           = (known after apply)
      + language     = "ruby"
      + last_updated = (known after apply)
      + name         = "new service with owner (both, should fail)"
      + owner        = (known after apply)
      + owner_alias  = (known after apply)
    }

  # opslevel_service.new_service_id will be created
  + resource "opslevel_service" "new_service_id" {
      + description  = "this was made in terraform"
      + framework    = "rails"
      + id           = (known after apply)
      + language     = "ruby"
      + last_updated = (known after apply)
      + name         = "new service with owner (id)"
      + owner        = (known after apply)
    }

  # opslevel_service.new_service_old will be created
  + resource "opslevel_service" "new_service_old" {
      + description  = "this was made in terraform"
      + framework    = "rails"
      + id           = (known after apply)
      + language     = "ruby"
      + last_updated = (known after apply)
      + name         = "new service with owner_alias"
      + owner_alias  = (known after apply)
    }

  # opslevel_team.new_team will be created
  + resource "opslevel_team" "new_team" {
      + alias        = (known after apply)
      + id           = (known after apply)
      + last_updated = (known after apply)
      + name         = "this team was made in terraform"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
╷
│ Warning: "owner_alias": [DEPRECATED] field 'owner_alias' on service is no longer supported please use the 'owner' field.
│ 
│   with opslevel_service.new_service_old,
│   on service.tf line 5, in resource "opslevel_service" "new_service_old":
│    5: resource "opslevel_service" "new_service_old" {
│ 
│ (and 3 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated attribute
│ 
│   on service.tf line 12, in resource "opslevel_service" "new_service_old":
│   12:   owner_alias = opslevel_team.new_team.alias
│ 
│ The attribute "alias" is deprecated. Refer to the provider documentation for details.
│ 
│ (and 7 more similar warnings elsewhere)
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

opslevel_team.new_team: Creating...
opslevel_team.new_team: Creation complete after 2s [id=Z2lkOi8vb3BzbGV2ZWwvVGVhbS8xMTQ0NA]
opslevel_service.new_service_old: Creating...
opslevel_service.new_service_alias: Creating...
opslevel_service.new_service_both: Creating...
opslevel_service.new_service_id: Creating...
╷
│ Warning: "owner_alias": [DEPRECATED] field 'owner_alias' on service is no longer supported please use the 'owner' field.
│ 
│   with opslevel_service.new_service_old,
│   on service.tf line 5, in resource "opslevel_service" "new_service_old":
│    5: resource "opslevel_service" "new_service_old" {
│ 
│ (and one more similar warning elsewhere)
╵
╷
│ Warning: Deprecated attribute
│ 
│   on service.tf line 12, in resource "opslevel_service" "new_service_old":
│   12:   owner_alias = opslevel_team.new_team.alias
│ 
│ The attribute "alias" is deprecated. Refer to the provider documentation for details.
│ 
│ (and 7 more similar warnings elsewhere)
╵
╷
│ Error: OpsLevel API Errors:
│       - 'alias' slug is locked, it cannot be deleted
│ 
│ 
│   with opslevel_service.new_service_old,
│   on service.tf line 5, in resource "opslevel_service" "new_service_old":
│    5: resource "opslevel_service" "new_service_old" {
│ 
╵
╷
│ Error: OpsLevel API Errors:
│       - 'alias' slug is locked, it cannot be deleted
│ 
│ 
│   with opslevel_service.new_service_alias,
│   on service.tf line 15, in resource "opslevel_service" "new_service_alias":
│   15: resource "opslevel_service" "new_service_alias" {
│ 
╵
╷
│ Error: OpsLevel API Errors:
│       - 'alias' slug is locked, it cannot be deleted
│ 
│ 
│   with opslevel_service.new_service_id,
│   on service.tf line 25, in resource "opslevel_service" "new_service_id":
│   25: resource "opslevel_service" "new_service_id" {
│ 
╵
╷
│ Error: can pass only one of: owner owner_alias
│ 
│   with opslevel_service.new_service_both,
│   on service.tf line 35, in resource "opslevel_service" "new_service_both":
│   35: resource "opslevel_service" "new_service_both" {
│ 
╵
$ terraform destroy
opslevel_team.new_team: Refreshing state... [id=Z2lkOi8vb3BzbGV2ZWwvVGVhbS8xMTQ0NA]
opslevel_service.new_service_id: Refreshing state... [id=Z2lkOi8vb3BzbGV2ZWwvU2VydmljZS84Mjg2Mg]
opslevel_service.new_service_alias: Refreshing state... [id=Z2lkOi8vb3BzbGV2ZWwvU2VydmljZS84Mjg2MA]
opslevel_service.new_service_old: Refreshing state... [id=Z2lkOi8vb3BzbGV2ZWwvU2VydmljZS84Mjg2MQ]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # opslevel_service.new_service_alias will be destroyed
  - resource "opslevel_service" "new_service_alias" {
      - aliases     = [
          - "new_service_with_owner_alias",
        ] -> null
      - description = "this was made in terraform" -> null
      - framework   = "rails" -> null
      - id          = "Z2lkOi8vb3BzbGV2ZWwvU2VydmljZS84Mjg2MA" -> null
      - language    = "ruby" -> null
      - name        = "new service with owner (alias)" -> null
      - owner       = "this_team_was_made_in_terraform" -> null
      - owner_alias = "this_team_was_made_in_terraform" -> null
      - tags        = [] -> null
    }

  # opslevel_service.new_service_id will be destroyed
  - resource "opslevel_service" "new_service_id" {
      - aliases     = [
          - "new_service_with_owner_id",
        ] -> null
      - description = "this was made in terraform" -> null
      - framework   = "rails" -> null
      - id          = "Z2lkOi8vb3BzbGV2ZWwvU2VydmljZS84Mjg2Mg" -> null
      - language    = "ruby" -> null
      - name        = "new service with owner (id)" -> null
      - owner       = "this_team_was_made_in_terraform" -> null
      - owner_alias = "this_team_was_made_in_terraform" -> null
      - tags        = [] -> null
    }

  # opslevel_service.new_service_old will be destroyed
  - resource "opslevel_service" "new_service_old" {
      - aliases     = [
          - "new_service_with_owner_alias_2",
        ] -> null
      - description = "this was made in terraform" -> null
      - framework   = "rails" -> null
      - id          = "Z2lkOi8vb3BzbGV2ZWwvU2VydmljZS84Mjg2MQ" -> null
      - language    = "ruby" -> null
      - name        = "new service with owner_alias" -> null
      - owner       = "this_team_was_made_in_terraform" -> null
      - owner_alias = "this_team_was_made_in_terraform" -> null
      - tags        = [] -> null
    }

  # opslevel_team.new_team will be destroyed
  - resource "opslevel_team" "new_team" {
      - alias = "this_team_was_made_in_terraform" -> null
      - id    = "Z2lkOi8vb3BzbGV2ZWwvVGVhbS8xMTQ0NA" -> null
      - name  = "this team was made in terraform" -> null
    }

Plan: 0 to add, 0 to change, 4 to destroy.
╷
│ Warning: "owner_alias": [DEPRECATED] field 'owner_alias' on service is no longer supported please use the 'owner' field.
│ 
│   with opslevel_service.new_service_old,
│   on service.tf line 5, in resource "opslevel_service" "new_service_old":
│    5: resource "opslevel_service" "new_service_old" {
│ 
│ (and one more similar warning elsewhere)
╵
╷
│ Warning: Deprecated attribute
│ 
│   on service.tf line 12, in resource "opslevel_service" "new_service_old":
│   12:   owner_alias = opslevel_team.new_team.alias
│ 
│ The attribute "alias" is deprecated. Refer to the provider documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

opslevel_service.new_service_id: Destroying... [id=Z2lkOi8vb3BzbGV2ZWwvU2VydmljZS84Mjg2Mg]
opslevel_service.new_service_old: Destroying... [id=Z2lkOi8vb3BzbGV2ZWwvU2VydmljZS84Mjg2MQ]
opslevel_service.new_service_alias: Destroying... [id=Z2lkOi8vb3BzbGV2ZWwvU2VydmljZS84Mjg2MA]
opslevel_service.new_service_old: Destruction complete after 2s
opslevel_service.new_service_id: Destruction complete after 2s
opslevel_service.new_service_alias: Destruction complete after 2s
opslevel_team.new_team: Destroying... [id=Z2lkOi8vb3BzbGV2ZWwvVGVhbS8xMTQ0NA]
opslevel_team.new_team: Destruction complete after 1s

Destroy complete! Resources: 4 destroyed.
```